emacs.org
#+PROPERTY:    tangle build/init-main.el
#+PROPERTY:    eval no-export
#+PROPERTY:    results silent
#+PROPERTY:    header-args:sh  :tangle no

* Introduction

This is a literate version of my base emacs config. You can generate
emacs init script out of it by running =org-babel-tangle=.

The script assumes that this folder is either checked out to
=~/.emacs.d= or linked to it.


#+BEGIN_SRC elisp :tangle init.el
  ;; (package-initialize)
  (load-file "~/.emacs.d/build/init-main.el")
  (server-start)
#+END_SRC

* Common Problems

** URL not null in el-get

This is caused by missing "secure" url in some recipes. Just eval
function from [[https://github.com/dimitri/el-get/pull/2468][PR]] (if you hit it).

** Slime install

Make sure you have this: brew link texinfo --force

* Emacs essentials

Help is behind =C-h= or =F1=. To be more precise, in help:

1. =w= (or =where-is=) - to find shortcuts for the command
2. =f= (of =describe-function=) - to learn all about function.

* General settings

** Home directory

Let's define our own constant for the emacs directory and a function
to get subdir:

#+BEGIN_SRC elisp
  (defconst ra/emacs-directory (concat (getenv "HOME") "/.emacs.d/"))
  (defun ra/emacs-subdirectory (d) (expand-file-name d ra/emacs-directory))
#+END_SRC


I don't recall why I still have this setting, but let it be:

#+BEGIN_SRC elisp
(setq emacs-root-dir user-emacs-directory)
#+END_SRC

** Load system-specific overrides

We might have some local custom stuff around (e.g. brew location of
erlang), so let's look up that in machine-specific file:

#+BEGIN_SRC elisp
  (setq ra/emacs-machine-init
        (expand-file-name (concat system-name ".el") ra/emacs-directory)
        )

  ;; (setq custom-file (expand-file-name "init-local.el" ra/emacs-directory))
  (when (file-exists-p ra/emacs-machine-init)
    (load ra/emacs-machine-init))

  ;; This sets $MANPATH, $PATH and exec-path from your shell, but only on OS X and Linux.
  (when (memq window-system '(mac ns x))
    (exec-path-from-shell-initialize))

#+END_SRC


*** Rinat's rMBR

#+BEGIN_SRC elisp :tangle Rinats-MacBook-Pro.local.el
  ;;config for R on OSX
  (setq inferior-R-program-name "/usr/local/Cellar/r/3.2.2_1/bin/R")

#+END_SRC

** Setup load paths

I  have two  load  paths, =lisp=  for  v1 logic  and  =build= for  the
literate version (or v2):

#+BEGIN_SRC elisp
(add-to-list 'load-path (ra/emacs-subdirectory "lisp"))
(add-to-list 'load-path (ra/emacs-subdirectory "build"))
#+END_SRC

** Add usr/local/bin

Emacs can be [[http://emacs.stackexchange.com/questions/550/exec-path-and-path][weird with PATH]], so we set local bin path explicitly:

#+BEGIN_SRC elisp
  (add-to-list 'exec-path "/usr/local/bin/")
#+END_SRC

** Tramp

#+BEGIN_SRC elisp
  (setq tramp-default-method "ssh")
#+END_SRC


* Helper functions
Just a few helper functions to lighten up the day
#+BEGIN_SRC elisp

  (defun add-hook-list (callback hooks)
    "Adds callback to each one of the hooks."
    (mapc (lambda (hook)
        (add-hook hook callback))
          hooks))


  (defun downcase-first-char (&optional string)
    "Capitalize only the first character of the input STRING."
    (when (and string (> (length string) 0))
      (let ((first-char (substring string nil 1))
            (rest-str   (substring string 1)))
        (concat (downcase first-char) rest-str))))
#+END_SRC

* Packages
** Install Package manager

Let's install el-get, if it isn't installed:

#+BEGIN_SRC elisp
  (add-to-list 'load-path (expand-file-name "el-get/el-get" emacs-root-dir))

  (unless (require 'el-get nil 'noerror)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.github.com/dimitri/el-get/master/el-get-install.el")
      (let (el-get-master-branch)
        (goto-char (point-max))
        (eval-print-last-sexp))))

#+END_SRC
** Load recipes from small files

We can also have dependencies spread across tiny files (legacy stuff)
and load them like this:

#+BEGIN_SRC elisp
;; load all .el files inside `modules-dir`
(setq modules-dir (expand-file-name "packages" emacs-root-dir))
(mapc 'load (directory-files modules-dir 't "^[^#].*el$"))
#+END_SRC
** Describe dependencies explicitly
We can describe our common dependencies like this:

#+BEGIN_SRC elisp
  ;; modern list library
  (el-get-bundle dash)

  (el-get-bundle queue)
  (el-get-bundle dired-plus)
  (el-get-bundle flycheck)
  (el-get-bundle yasnippet)
  (el-get-bundle company-mode)
  ;; Swap buffers without typing C-x b on each window
  (el-get-bundle buffer-move)
  (el-get-bundle hydra)
  (el-get-bundle web-mode)
  ;; undo tree git-style
  (el-get-bundle undo-tree)

  (require 'company)
#+END_SRC
** Common requires
#+BEGIN_SRC elisp
  (require 'dash)
#+END_SRC

** Key-chords

Key-chord lets you define keystrokes (e.g. =zz=) which, if pressed in
rapid sequence, will trigger some effect. It has a side-effect: if a
key is present in a key-chord, it will work slower. So we'll try to
keep these to a bare minimum.

Let's enable key-chord:

#+BEGIN_SRC elisp
  (el-get-bundle key-chord)
  (require 'key-chord)
  (key-chord-mode 1)
#+END_SRC

* Display settings
** Hide some things
#+BEGIN_SRC elisp
  ;; I know what the scratch is for
  (setq initial-scratch-message "")

  ;; don't show the startup help screen
  (setq inhibit-startup-screen t)

  ;; disable alarm bell beep
  (setq visible-bell t)
  ;; flash on OSX looks ugly
  (setq ring-bell-function 'ignore)
#+END_SRC

** Windows
*** Wind move

[[http://emacswiki.org/emacs/WindMove][WindMove]] (in GnuEmacs v21+) lets you move point from window to window
using Shift and the arrow keys. I wire it to use Super+VIM keys (CMD
on OSX). This way moves are consistent with Super+Arrow keys I use for
the primary window manager.

#+BEGIN_SRC elisp
  ;; move to a neighbor window using SUPER + VIM KEY
  (require 'windmove)
  (global-set-key (kbd "s-k") 'windmove-up)
  (global-set-key (kbd "s-j") 'windmove-down)
  (global-set-key (kbd "s-h") 'windmove-left)
  (global-set-key (kbd "s-l") 'windmove-right)
#+END_SRC

*** Buf move

Let's bind similar keys (but with =Shift=) to move windows around:

#+BEGIN_SRC elisp
  (global-set-key (kbd "s-S-H") 'buf-move-left)
  (global-set-key (kbd "s-S-J") 'buf-move-down)
  (global-set-key (kbd "s-S-K") 'buf-move-up)
  (global-set-key (kbd "s-S-L") 'buf-move-right)
#+END_SRC

*** Winner mode

[[http://emacswiki.org/emacs/WinnerMode][Winner mode]] allows you to “undo” (and “redo”) changes in the window
configuration with =C-c left= and =C-c right=.

#+BEGIN_SRC elisp
  (winner-mode 1)
#+END_SRC

*** Hydra

Hydra-based way of manipulating windows. Let's define a few helpers
(taken from hydra samples):

#+BEGIN_SRC elisp
  (defun hydra-move-splitter-left (arg)
    "Move window splitter left."
    (interactive "p")
    (if (let ((windmove-wrap-around))
          (windmove-find-other-window 'right))
        (shrink-window-horizontally arg)
      (enlarge-window-horizontally arg)))

  (defun hydra-move-splitter-right (arg)
    "Move window splitter right."
    (interactive "p")
    (if (let ((windmove-wrap-around))
          (windmove-find-other-window 'right))
        (enlarge-window-horizontally arg)
      (shrink-window-horizontally arg)))

  (defun hydra-move-splitter-up (arg)
    "Move window splitter up."
    (interactive "p")
    (if (let ((windmove-wrap-around))
          (windmove-find-other-window 'up))
        (enlarge-window arg)
      (shrink-window arg)))

  (defun hydra-move-splitter-down (arg)
    "Move window splitter down."
    (interactive "p")
    (if (let ((windmove-wrap-around))
          (windmove-find-other-window 'up))
        (shrink-window arg)
      (enlarge-window arg)))
#+END_SRC

Ok, let's define a hydra head for moving windows around on =F2=:

#+BEGIN_SRC elisp
  (defhydra ra/hydra-windows (global-map "<f2>")
    "winops"
    ("SPC" nil)
    ("<left>"  hydra-move-splitter-left)
    ("<down>" hydra-move-splitter-down)
    ("<up>" hydra-move-splitter-up)
    ("<right>" hydra-move-splitter-right)
    ("x" delete-window :color blue)
    ("X" delete-other-windows :color blue)
    ("z" (progn
          (winner-undo)
          (setq this-command 'winner-undo))
     )
    ("Z" winner-redo)
    ("r" split-window-right :color blue)
    ("b" split-window-below :color blue)
    )
#+END_SRC

** Mode line

[[https://github.com/Malabarba/smart-mode-line][Smart mode line]] improves a lot normal emacs mode line by adding:

- colors;
- directory prefixing (e.g. convert =~/.emacs.d/= to =:ED:=;
- smart truncation to work well on small displays.

Line format was taken from [[http://pages.sachachua.com/.emacs.d/Sacha.html][Sasha Chua]].


#+BEGIN_SRC elisp
  ;; get smart-mode-line
  (el-get-bundle smart-mode-line)
  ;; respect the current theme
  (setq sml/theme 'respectful)
  ;; don't ask for confirmation
  (setq sml/no-confirm-load-theme t)
  ;; taken from Sasha Chua
  (setq-default
     mode-line-format
     '("%e"
       mode-line-front-space
       mode-line-mule-info
       mode-line-client
       mode-line-modified
       mode-line-remote
       mode-line-frame-identification
       mode-line-buffer-identification
       "  "
       mode-line-position
       (vc-mode vc-mode)
       "  "
       mode-line-modes
       mode-line-misc-info
       mode-line-end-spaces))

  (sml/setup)
#+END_SRC

If I ever needed to hide some minor modes, this could be done via
[[https://github.com/Malabarba/rich-minority][rich-minority]] package.

Oh, while we are at it, let's display battery percentage:

#+BEGIN_SRC elisp
  (display-battery-mode)
#+END_SRC

** Cursor
Make the cursor blink:
#+BEGIN_SRC elisp
;; blinking cursor
(blink-cursor-mode t)
#+END_SRC
* GUI Client

Emacs can have a nice GUI window that lets you have fine-grained
control over fonts and sizes. Let's put that stuff into a separate
config file and load when we have us a window system.

   #+BEGIN_SRC elisp
     (require 'init-client)
   #+END_SRC

Header for the client-specific file would say:

#+BEGIN_SRC elisp :tangle build/init-client.el
(provide 'init-client)
#+END_SRC

** Fonts

I like Monaco on OSX:

#+BEGIN_SRC elisp :tangle build/init-client.el
  (when (eq system-type 'darwin)
    ;; set default font for the frames as well (daemon + ec)
    (setq default-frame-alist '((font . "MonacoB-14")))
    (set-fontset-font t 'cyrillic "Droid Sans Mono")
    )
#+END_SRC

** Color theme
I like to use solarized theme by default:

#+BEGIN_SRC elisp :tangle build/init-client.el
  (el-get-bundle color-theme-solarized)
  (load-theme 'solarized t)
#+END_SRC

It would be nice to switch to solarized dark, if needed. Let's add
hydra for that:

#+BEGIN_SRC elisp :tangle build/init-client.el
  (defhydra hydra-themes (global-map "<f9>")
    "themes"
    ("SPC" nil)
    ("q"
     (lambda ()
       (interactive)
       (load-theme 'solarized-light t)
       )
     )
    ("w"
     (lambda ()
       (interactive)
       (load-theme 'solarized-dark t)
       )
     )
    )
#+END_SRC

** Zooming with Hydra
With this simple code, hit =F9= to enter zooming mode:

#+BEGIN_SRC elisp :tangle build/init-client.el
  (defhydra hydra-zoom (global-map "<f6>")
    "zoom"
    ("+" text-scale-increase "in")
    ("=" text-scale-increase "in")
    ("-" text-scale-decrease "out"))
#+END_SRC

** Remove clutter

Some things just waste space, let's kill them once and for all frames
(this works even for emacs in daemon mode and emacsclient).

#+BEGIN_SRC elisp
  (add-to-list 'default-frame-alist '(vertical-scroll-bars . nil))
  (add-to-list 'default-frame-alist '(left-fringe . 0))
  (add-to-list 'default-frame-alist '(right-fringe . 0))
  (add-to-list 'default-frame-alist '(menu-bar-lines . 0))
  (add-to-list 'default-frame-alist '(tool-bar-lines . 0))
#+END_SRC

* Editing experience
** Dired

Dired can work like a total commander and guess targets when two
windows are open:
#+BEGIN_SRC elisp
(setq dired-dwim-target t)
#+END_SRC
** iBuffer

Let's group our buffers in the ibuffer window.

#+BEGIN_SRC elisp
  (setq ibuffer-saved-filter-groups
        (quote (("default"
                 ("dired" (mode . dired-mode))
                    ;;("perl" (mode . cperl-mode))
                 ;;("erc" (mode . erc-mode))

                 ("org" (or
                         (mode . org-mode)
                         (name . "^\\*Calendar\\*$")
                         (name . "^diary$")
                         (name . "^\\.org$")
                         (mode . muse-mode)))
                 ("emacs" (or
                           (name . "^\\*scratch\\*$")
                           (name . "^\\*Messages\\*$")
                           ))

                 ("clojure" (or
                             (mode . clojure-mode)
                             (name . "^\\*cider\\*$")
                             (name . "^\\*nrepl\\*$")
                             ))
               
                 ("go" (mode . go-mode))
                 ("js" (or
                        (mode . rjsx-mode)
                        (mode . js-mode)
                        ))
                    ;; ("gnus" (or
                    ;;          (mode . message-mode)
                    ;;          (mode . bbdb-mode)
                    ;;          (mode . mail-mode)
                    ;;          (mode . gnus-group-mode)
                    ;;          (mode . gnus-summary-mode)
                    ;;          (mode . gnus-article-mode)
                    ;;          (name . "^\\.bbdb$")
                    ;;          (name . "^\\.newsrc-dribble")))
                 ))))


  (add-hook 'ibuffer-mode-hook
            (lambda ()
              (ibuffer-switch-to-saved-filter-groups "default")))
#+END_SRC

** Markdown
Load the package with el-get:

#+BEGIN_SRC elisp
(el-get-bundle markdown-mode)
#+END_SRC

And bind it do the files:
#+BEGIN_SRC elisp
  (add-to-list 'auto-mode-alist
               '("\\.\\(md\\|mdown\\|markdown\\)\\'" . markdown-mode)
               )
#+END_SRC
** Unfill paragraph

Unfilling a paragraph joins all the lines in a paragraph into a single
line. It is the contrary of FillParagraph.

#+BEGIN_SRC elisp
  ;;; Stefan Monnier <foo at acm.org>. It is the opposite of fill-paragraph
  (defun ra/unfill-paragraph (&optional region)
    "Takes a multi-line paragraph and makes it into a single line of text."
    (interactive (progn (barf-if-buffer-read-only) '(t)))
    (let ((fill-column (point-max)))
      (fill-paragraph nil region)))
#+END_SRC

And let's bind it to a keystroke:

#+BEGIN_SRC elisp
  (define-key global-map "\M-Q" 'ra/unfill-paragraph)
#+END_SRC
** Auto-fill mode

To turn auto-filling on (saves M-q presses):

#+BEGIN_SRC elisp
  (global-set-key (kbd "C-c q") 'auto-fill-mode)
#+END_SRC

** Expand Region

[[https://github.com/magnars/expand-region.el][Expand region]] increases the selected region by semantic units. Just
keep pressing the key until it selects what you want.

#+BEGIN_SRC elisp
  ;; smart region expansion
  (el-get-bundle expand-region)
  (global-set-key (kbd "C-=") 'er/expand-region)
#+END_SRC

